{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "HuggingFaceTB/SmolLM-360M-Instruct",
  "bias": "none",
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_bias": false,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
<<<<<<<< HEAD:ppo_trained_model_v2/Tone/adapter_config.json
    "o_proj",
    "v_proj",
    "k_proj",
    "down_proj",
    "q_proj",
    "gate_proj",
    "up_proj"
========
    "v_proj",
    "k_proj",
    "up_proj",
    "down_proj",
    "gate_proj",
    "o_proj",
    "q_proj"
>>>>>>>> 5024bd6e8cd2803ed384288e290367dd139eee20:dpo_checkpoints_dummy/Tone/adapter_config.json
  ],
  "task_type": "CAUSAL_LM",
  "use_dora": false,
  "use_rslora": false
}